Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 32, 32, 128)       9728      
_________________________________________________________________
leaky_re_lu_34 (LeakyReLU)   (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 16, 16, 128)       262272    
_________________________________________________________________
leaky_re_lu_35 (LeakyReLU)   (None, 16, 16, 128)       0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 8, 8, 128)         262272    
_________________________________________________________________
leaky_re_lu_36 (LeakyReLU)   (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 4, 256)         524544    
_________________________________________________________________
leaky_re_lu_37 (LeakyReLU)   (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 4, 4, 256)         590080    
_________________________________________________________________
leaky_re_lu_38 (LeakyReLU)   (None, 4, 4, 256)         0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 4, 4, 256)         1048832   
_________________________________________________________________
leaky_re_lu_39 (LeakyReLU)   (None, 4, 4, 256)         0         
_________________________________________________________________
mb_st_dev_3 (MBStDev)        (None, 4, 4, 257)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 4112)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 4113      
=================================================================
Total params: 2,701,841
Trainable params: 2,701,841
Non-trainable params: 0
_________________________________________________________________
