Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_6 (Dense)              (None, 8192)              2105344   
_________________________________________________________________
reshape_3 (Reshape)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 8, 8, 128)         409728    
_________________________________________________________________
pixel_norm_12 (PixelNorm)    (None, 8, 8, 128)         0         
_________________________________________________________________
leaky_re_lu_30 (LeakyReLU)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 8, 8, 128)         262272    
_________________________________________________________________
pixel_norm_13 (PixelNorm)    (None, 8, 8, 128)         0         
_________________________________________________________________
leaky_re_lu_31 (LeakyReLU)   (None, 8, 8, 128)         0         
_________________________________________________________________
up_sampling2d_6 (UpSampling2 (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 16, 16, 128)       409728    
_________________________________________________________________
pixel_norm_14 (PixelNorm)    (None, 16, 16, 128)       0         
_________________________________________________________________
leaky_re_lu_32 (LeakyReLU)   (None, 16, 16, 128)       0         
_________________________________________________________________
up_sampling2d_7 (UpSampling2 (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 32, 32, 128)       409728    
_________________________________________________________________
pixel_norm_15 (PixelNorm)    (None, 32, 32, 128)       0         
_________________________________________________________________
leaky_re_lu_33 (LeakyReLU)   (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 32, 32, 3)         9603      
=================================================================
Total params: 3,606,403
Trainable params: 3,606,403
Non-trainable params: 0
_________________________________________________________________
